#include <stdio.h>
/*
 *  Test
 *      Scanf和Printf函数的各种使用情况
 */
int main(void){
    int a,b;

//    //  要求输入数据12 34
//    scanf("%d %d",&a,&b);
//    printf("a = %d,b = %d\n",a,b);
//
//    //  要求输入数据12,34
//    scanf("%d,%d",&a,&b);   //在两个格式转换说明符之间使用 , 隔开
//    printf("a = %d,b = %d\n",a,b);
//
//    //  要求用户输入数据:a=12,b=34
//    scanf("a = %d,b = %d",&a,&b);   //在两个格式转换说明符之前加上a= ， b=
//    printf("a = %d,b = %d\n",a,b);
//
//    //  要求输入数据限定为:1234 ,同时要求程序输出结果为a=12,b=34
//    scanf("%2d%2d",&a,&b);  //在两个格式转换说明符前加上2,表示限定2个字符
//    printf("a = %d,b = %d\n",a,b);

//    //  输入数据限定为:12 '\r'(空格转义符) 34 ，同时要求输入结果为a = "12",b = "34"
//    scanf("%d %d",&a,&b);
//    printf("a = \" %d \",b = \" %d \" \n",a,b); //字符 \" 是转义字符，代表双引号字符
//
//    //  用户可以用任意字符作为分隔符输入数据
//    scanf("%d *c %d",&a,&b);
//    printf("a = %d,b = %d\n",a,b);
//
//    //  输入123456，要求输出结果为: a=12,b=56
//    scanf("%2d %*2d %2d",&a,&b);    //说明符: %*2 中的 * 表示忽略输入修饰符，2 表示2个字符的域宽
//    printf("a = %d,b = %d",a,b);
//
//    //  错误写法:使用scanf()未在变量前面加上取地址运算符 & ,则会报错
//    scanf("%d %d",a,b);
//    printf("a = %d,b = %d\n",a,b);

    return 0;
}